app/controllers/tokens_controller.rb

  def create
    secret_key = params[:secret_key]
    key = params[:key]
    if request.format != :json
      render :status=>406, :json=>{:status=>"Failure",:message=>"The request must be json"}
      return
    end

    if secret_key.nil? or key.nil?
       render :status=>400,
              :json=>{:status=>"Failure",:message=>"The request must contain the secret key and key."}
       return
    end

    @user = User.find_by_key(key)

    if params[:device_token].present?
      device = Device.where(:token => params[:device_token]).first
      if device.present?
        device.update_column(:user_id, @user.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`key` = '277c3dc569eed8605844b997087f578301be6c1d' LIMIT 1
UPDATE `users` SET `last_sign_in_at` = '2015-10-11 15:32:02', `current_sign_in_at` = '2015-10-11 15:32:02', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2015-10-11 15:32:02' WHERE `users`.`type` IN ('Doctor') AND `users`.`id` = 7

  def get_key
    email = params[:email]
#    username = params[:username]
    password = params[:password]
    if request.format != :json
      render :status=>406, :json=>{:status=>"Failure",:message=>"The request must be json"}
      return
    end

#    if username.nil? or password.nil?
#      render :status=>400,:json=>{:status=>"Failure",:message=>"The request must contain the user name and password."}
#      return
#    end

    if email.nil? or password.nil?
      render :status=>400,:json=>{:status=>"Failure",:message=>"The request must contain the email and password."}
      return
    end

#    @user=User.find_by_username(username)
    @user=User.find_by_email(email.downcase)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'shivs@example.com' LIMIT 1

              :json => {:status=>"Failure",:message=>"Email Address is required"}
       return
    else
      user_exist = User.find_by_email(params[:email])
      if user_exist.present?
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'shiv@exsample.com' LIMIT 1
SELECT 1 AS one FROM `users` WHERE `users`.`email` = BINARY 'shiv@exsample.com' LIMIT 1

          :type => 'Patient'
                })
    @user.skip_confirmation!
    if @user.save
---
INSERT INTO `users` (`authentication_token`, `confirmation_sent_at`, `confirmation_token`, `created_at`, `email`, `encrypted_password`, `key`, `secret_key`, `specialize`, `status`, `updated_at`, `username`) VALUES ('mt9ZsWezM4iQg8hDdiZm', '2015-10-11 15:20:19', '7svTyAi2pHuzuUtZtsDc', '2015-10-11 15:20:18', 'shiv@exsample.com', '$2a$10$h5AOGZ5uJ8rcMZAzklk9EOuHkoMbPI.uVPy5FaVTRtNCDxgVSnj8C', '5c7677eee4f250e204ed4780963406f3d6e0a02c', '126630182fb801de6d38579c94766cee5f64c889', 'dentist', 1, '2015-10-11 15:20:18', 'Shiv kumar')
UPDATE `users` SET `last_sign_in_at` = '2015-10-11 15:20:19', `current_sign_in_at` = '2015-10-11 15:20:19', `last_sign_in_ip` = '127.0.0.1', `current_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2015-10-11 15:20:19' WHERE `users`.`id` = 8